{
  "kalimas": [
    {
      "kalima_number": 1,
      "arabic": "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ مُحَمَّدٌ رَسُولُ ٱللَّٰهِ",
      "trans":"La ilaha illallahu muhammadur rasulullah",
      "urdu": "اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں",
      "english": "There is none worthy of worship except God (Allah) and Muhammad is the messenger of God."
    },
    {
      "kalima_number": 2,
      "arabic": "اَشْهَدُ اَنْ لَّآ اِلٰهَ اِلَّا اللهُ وَحْدَہٗ لَاشَرِيْكَ لَہٗ وَاَشْهَدُ اَنَّ مُحَمَّدًا عَبْدُهٗ وَرَسُولُہٗ",
      "trans":"ashhadu alla ilaha illallah wahdahu la sharika lahu lahu wa-ash-hadu anna Muhammadan abduhoo wa rasooluhu.",
      "urdu": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اور میں گواہی دیتا ہوں کہ محمد ﷺ اللہ کے بندے اور رسول ہیں",
      "english": "I bear witness that there is no deity but Allah, He is One, there is no partner with Him, and I bear witness that Muhammad is His servant and Messenger"
    },
    {
      "kalima_number": 3,
      "arabic": "سُبْحَان اللهِ وَالْحَمْدُلِلّهِ وَلا إِلهَ إِلّااللّهُ وَاللّهُ أكْبَرُ وَلا حَوْلَ وَلاَ قُوَّةَ إِلَّا بِاللّهِ الْعَلِيِّ الْعَظِيْم",
      "trans":"subhanallah walhamdulillah wala ilaha illallah wallahu akbar wala hawla wala quwwata illa billah aliyyil azeem",
      "urdu": "پاک ہے اللہ، سب تعریفیں اللہ ہی کے لیے ہیں، اللہ کے سوا کوئی معبود نہیں، اللہ سب سے بڑا ہے، اور طاقت و قوت صرف اللہ عظیم و بلند ہی کی طرف سے ہے",
      "english": "Glory be to Allah, all praise is due to Allah, there is no deity but Allah, Allah is the Greatest, and there is no power and no strength except with Allah, the Most High, the Great"
    },
    {
      "kalima_number": 4,
      "arabic": "لَآ اِلٰهَ اِلَّا اللهُ وَحْدَهٗ لَا شَرِيْكَ لَهٗ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْىٖ وَ يُمِيْتُ وَ هُوَحَیٌّ لَّا يَمُوْتُ اَبَدًا اَبَدًاؕ ذُو الْجَلَالِ وَالْاِكْرَامِؕ بِيَدِهِ الْخَيْرُؕ وَهُوَ عَلٰى كُلِّ شیْ ٍٔ قَدِیْر",
      "trans":"la ilaha illallah wahdahu la sharika lahu, lahul mulku wa lahul hamdu yuhyi wa yumitu Wahuwa Hayyu-l Laa Yamootu Abadan Abada. Dhul Jalaali Wal Ikraam. Biyadihil Khair. Wahuwa Ala Kulli Shai-in Qadeer.",
      "urdu": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کی بادشاہت ہے، اور سب تعریفیں اسی کے لیے ہیں، اور وہ ہر چیز پر قادر ہے",
      "english": "There is no deity but Allah, He is One, there is no partner with Him, His is the kingdom, and all praise is for Him, and He is over all things capable"
    },
    {
      "kalima_number": 5,
      "arabic": "اَسْتَغْفِرُ اللهِ رَبِّىْ مِنْ كُلِِّ ذَنْۢبٍ اَذْنَبْتُهٗ عَمَدًا اَوْ خَطَا ًٔ سِرًّا اَوْ عَلَانِيَةً وَّاَتُوْبُ اِلَيْهِ مِنَ الذَّنْۢبِ الَّذِیْٓ اَعْلَمُ وَ مِنَ الذَّنْۢبِ الَّذِىْ لَآ اَعْلَمُ اِنَّكَ اَنْتَ عَلَّامُ الْغُيُوْبِ وَ سَتَّارُ الْعُيُوْبِ و َغَفَّارُ الذُّنُوْبِ وَ لَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللهِ الْعَلِىِِّ الْعَظِيْمِؕ",
      "trans":"Astaghfirullah Rabbi Min Kulli Dhambin Adhnabtuhoo ‘Amadan Aw Khata-an Sirran Aw ‘Alaaniyata-wn Wa-atoobu Ilaihi Min-adh Dhambi-l Ladhee A’lamu Wamina-dh Dhambi-l Ladhi Laaa A’lamu Innaka Anta ‘Allaamu-l Ghuyoobi Wasattaaru-l ‘Uyoobi Wa Ghaffaaru-dh Dhunubi Walaa Hawla Walaa Quwwata Illaa Billaahi-l ‘Aliyyil ‘Azeem.",
      "urdu": "میں اللہ سے مغفرت چاہتا ہوں، اپنے رب سے، ہر اس گناہ کے لیے جو میں نے جان بوجھ کر یا غلطی سے کیا، چھپ کر یا علانیہ، اور میں اس سے توبہ کرتا ہوں جس کا مجھے علم ہے اور جس کا مجھے علم نہیں ہے۔ بے شک، تو غیبوں کا جاننے والا، عیبوں کا چھپانے والا، اور گناہوں کا بخشنے والا ہے۔ کوئی طاقت اور قوت نہیں مگر اللہ کے ساتھ، جو بلند عظمت والا ہے۔",
      "english": "I seek forgiveness from Allah, my Lord, from every sin I committed knowingly or unknowingly, secretly or openly, and I turn towards Him from the sin that I know and from the sin that I do not know. Certainly You, You (are) the knower of the hidden things and the Concealer (of) the mistakes and the Forgiver (of) the sins. And (there is) no power and no strength except from Allah, the Most High, the Most Great."
    },
    {
      "kalima_number": 6,
      "arabic": "اَللّٰهُمَّ اِنِّیْٓ اَعُوْذُ بِكَ مِنْ اَنْ اُشْرِكَ بِكَ شَيْئًا وَّاَنَآ اَعْلَمُ بِهٖ وَ اَسْتَغْفِرُكَ لِمَا لَآ اَعْلَمُ بِهٖ تُبْتُ عَنْهُ وَ تَبَرَّأْتُ مِنَ الْكُفْرِ وَ الشِّرْكِ وَ الْكِذْبِ وَ الْغِيْبَةِ وَ الْبِدْعَةِ وَ النَّمِيْمَةِ وَ الْفَوَاحِشِ وَ الْبُهْتَانِ وَ الْمَعَاصِىْ كُلِِّهَا وَ اَسْلَمْتُ وَ اَقُوْلُ لَآ اِلٰهَ اِلَّا اللهُ مُحَمَّدٌ رَّسُوْلُ اللهِؕ",
      "trans":"Allahumma Inne A’udhu-bika Min An Ushrika Bika Shay-awn Wa-ana A’lamu Bihee Wa-astaghfiruka Limaa Laaa A’lamu Bihee Tubtu ‘Anhu Wata-barraatu Mina-l Kufri Wash-shirki Wal-kidhbi Wal-gheebati Wal-bid’ati Wan-nameemati Wal-fawahishi Wal-buhtaani Wal-m’aasi Kulli-haa Wa-Aslamtu Wa-aqoolu Laaa Ilaaha Illa-llaahu Muhammadur Rasulullah.",
      "urdu": "اے اللہ! میں تیری پناہ چاہتا ہوں اس بات سے کہ میں جان بوجھ کر تیرے ساتھ کسی کو شریک بناؤں، اور میں اس بات کے لیے تیری مغفرت چاہتا ہوں جس کا مجھے علم نہیں۔ میں اس سے توبہ کرتا ہوں، کفر اور شرک، جھوٹ، غیبت، بدعت، چغلی، بے حیائی، اور تمام گناہوں سے بری الذمہ ہوں۔ میں تیرے سامنے جھکتا ہوں اور اعلان کرتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں۔",
      "english": "O Allah! I seek refuge in You from that I should ascribe any partner with You knowingly. I seek Your forgiveness for the sin of which I have no knowledge. I repent from it. And becoming disgusted of disbelief and idolatry, lying and backbiting, innovation and slander, lewdness and abomination and all other acts of disobedience, I submit to Your will. I believe and I declare that there is none worthy of worship except Allah and Muhammad is the Messenger of Allah."
    }
  ]
}
